/* ARRAY */
// Масиви це впорядкована коллекція данних.
// Масиви не є окремим типоп данних і відносяться до об'єктів.
// Оголошуються:
// 1-й варіант через конструктор Array.
let Arr = new Array();
// 2-й спосіб через літерал.
let arr = [] // через квадратні дужки.

let fruit = ["apple"] // Елементи списку не мають назви ключів, ці ключі мають номери і починаються з нуля "0"!!!
// замість ключа,що був в обєкті, в масиві цифри. За номером можна отримати значення елемента вмасиві.

console.log(fruit[0]) //в консолі виведеться "apple"
console.log(fruit[2]) // якщо в масиві немає елемента, то в консолі виведеться undefined.
// За номером можна додати елемент в масив.
fruit[4] = "orange"; // додається елемент "orange".
console.log(fruit) 
// fruits[ index ] = "orange" - номер індексу можна ставити який завгодно і під таким номером створиться значення.
//
// крім того в масиві зберігається загальна кількість елементів. Їх можна отримати за допомогою "length"
console.log(fruit.length) // Довжина масиву стала 5. Тому що є 1-й "apple" потім 3 порожніх і 4-й "orange".

// В масиві може зберігатися будь-який тип.
let newFruit = ["apple", 1, null , {name:"Ivan",age: 12}]; 
console.log(newFruit);
// звернення до name:"Ivan".
console.log(newFruit[3].name) // вивести значення ключя name.
console.log(newFruit[3].age)  // вивести значення ключя age.

//
let fruits = ["apple","orange","banana","pear"];
// Часто буває так що невідомо  скільки елементів в масиві, масив буде динамічно змінюватися і щоразу бе інший.
console.log(fruits[0]) // так отримується 1-й елемент.
// Якщо потрібно оримати останній елемент а кількість їх невідома тоді..
console.log(fruits[fruits.length - 1]) // Береться довжина масиву і віднімається 1, тому що індексація масиву рахується з "0"
// в такому випадку консоль повертає останній варінт.
// Ще один спосіб за допомогою "at". спосіб новий і не підримуєтсья всіма браузерами.
console.log(fruits.at(-1)) // отримується останній елемент.    аналагічно "console.log(fruits[fruits.length - 1])"
console.log(fruits.at(-2)) // отримується 2-й з кіньця.
console.log(fruits.at(0)) // поверне 1-й елемент.


/* МЕТОДИ */
// робота з додаванням і відніманням з початку і кінця масиву.
// Є 4-ри методи.

